Reports/бит_РегламентированныеОтчетыСтатистикиЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_РегламентированныеОтчетыСтатистикиЖКХ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУчетомРазовых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоциальнаяНормаПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтараяВерсия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия2019</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_РегламентированныеОтчетыСтатистикиЖКХ/Forms/ФормаОтчетаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если Клиент Тогда
		Отчет.Дата = РабочаяДата;
	#Иначе
		Отчет.Дата = ТекущаяДата();
	#КонецЕсли
	
	Отчет.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	
	Если ПустаяСтрока(Отчет.ВидФормы) Тогда
		Отчет.ВидФормы = "22";
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультат

&НаКлиенте
Процедура РезультатПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Если Отчет.ВидФормы <> "22" или Отчет.ВидФормы <> "22_Жилище" 
		                              или Отчет.ВидФормы <> "22_Жилище_2020"Тогда
		Возврат;
	КонецЕсли;
	
	Если Область.СодержитЗначение И Область.ТипЗначения.СодержитТип(Тип("Число")) Тогда
		Если Область.Значение = 0 И Область.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти = 0 Тогда
			
			ФорматПредставленияНуля = РегламентированнаяОтчетностьКлиентСервер.ПолучитьПредставлениеНуляИзСтрокиФормата(Область.Формат);
			
			ОтображениеНуля = СокрЛП(Формат(0, РегламентированнаяОтчетностьКлиентСервер.ЗаменитьПредставлениеНуляВСтрокеФормата(Область.Формат, "ЧН=")));
			Если ПустаяСтрока(ОтображениеНуля) Тогда
				ОтображениеНуля = "0";
			КонецЕсли;
			ТипСтрокиЗаполнения = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(СтрДлина(ОтображениеНуля), ДопустимаяДлина.Фиксированная));
			СтрокаЗаполнения = ТипСтрокиЗаполнения.ПривестиЗначение();
			
			Список = Новый СписокЗначений;
			Список.Добавить("ЧН=' '", "  <Пустое значение>    " + СтрокаЗаполнения);
			Список.Добавить("ЧН=" + ОтображениеНуля, "  Отображать как """ + ОтображениеНуля + """  ");
			
			НайденнаяСтрока = Список.НайтиПоЗначению(ФорматПредставленияНуля);
			
			ДополнительныеПараметры = Новый Структура("Область, Элемент", Область, Элемент); 
			ОписаниеОповещения = Новый ОписаниеОповещения("РезультатПриИзмененииСодержимогоОбластиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
						
			// обход ошибок платформы: в тонком клиенте не работает ПоказатьВыборИзСписка (ПоказатьВыборИзМеню не работает в веб-клиенте 
			// и в событии ПриИзмененииСодержимогоОбласти табличного документа - где мы его и хотим использовать прежде всего)
			# Если ВебКлиент Тогда
			
				Если НайденнаяСтрока = Неопределено Тогда
					ПоказатьВыборИзСписка(ОписаниеОповещения, Список, Элемент);
				Иначе
					ПоказатьВыборИзСписка(ОписаниеОповещения, Список, Элемент, НайденнаяСтрока);
				КонецЕсли;
				
			#Иначе
				
				Список.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите значение", Элемент);
					
			#КонецЕсли
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	ОбластьИмя = Элемент.ТекущаяОбласть.Имя;

	РасчетНаКлиенте("", ОбластьИмя);

	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзмененииСодержимогоОбластиЗавершение(СписокЭлемент, ДополнительныеПараметры) Экспорт
	
	Область = ДополнительныеПараметры.Область;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если СписокЭлемент <> Неопределено  Тогда
		
		Область.Формат = РегламентированнаяОтчетностьКлиентСервер.ЗаменитьПредставлениеНуляВСтрокеФормата(Область.Формат, СписокЭлемент.Значение);
		
	КонецЕсли;
	
	ОбластьИмя = Элемент.ТекущаяОбласть.Имя;
	
	РасчетНаКлиенте("", ОбластьИмя);
	
	//Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Попытка
		СформироватьНаСервере();
	Исключение	
	  Сообщить(ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_РегламентированныеОтчетыСтатистикиЖКХ"));
	
	
	ОтчетОбъект.ОбновитьОтчет(Результат);
	
	// БИТ_ЖКХ 12.11.2015 14:54:44 Начало правки... 
	РасчетНаСервере();
	// БИТ_ЖКХ 12.11.2015 14:54:45 Конец правки. 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт	

	Если Отчет.ВидФормы <> "22" Тогда
		Возврат;
	КонецЕсли;

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Если Отчет.ВидФормы <> "22" Тогда
		Возврат;
	КонецЕсли;
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяТекущейСтраницыПанели = "", ОбластьИмя = "")
	
	Области = Форма.Результат.Области;
	
	// БИТ_ЖКХ 24.04.2017 10:00:23 Начало правки... 
	Для Стр = 33 По 51 Цикл 
		Префикс = "П03" + Стр + "0";
		
		Тот = 0;
		Для Гр = 4 По 6 Цикл 
			Обл = Области.Найти(Префикс + Гр);
			Если Обл <> Неопределено Тогда 
				Тот = Тот + Обл.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Области.Найти(Префикс + "9").Значение = Тот;
	КонецЦикла;
	
	СуммаИнфо = Новый Соответствие;
	СуммаИнфо.Вставить("32", "33,34,37");
	СуммаИнфо.Вставить("38", "39,40,41,42,43,46,47,49,50,51");
	
	Для Гр = 3 По 9 Цикл 
		Постфикс = "0" + Гр;
		Для Каждого Элт Из СуммаИнфо Цикл 
			ДляСтр = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Элт.Значение, ",");
			Тот = 0;
			Для Каждого Строка Из ДляСтр Цикл 
				Обл = Области.Найти("П03"+Строка+Постфикс);
				Если Обл <> Неопределено Тогда 
					Тот = Тот + Обл.Значение;
				КонецЕсли;
			КонецЦикла;
			Области.Найти("П03" + Элт.Ключ + Постфикс).Значение = Тот;
		КонецЦикла;
		
		Области.Найти("П0352" + Постфикс).Значение = Области.Найти("П0332" + Постфикс).Значение + Области.Найти("П0338" + Постфикс).Значение;
	КонецЦикла;
	
	
	//// По разделу 2.
	//Для НомКол = 4 По 11 Цикл
	//	Области["П0000020019" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение =
	//		  Области["П0000020020" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000020021" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000020022" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение;
	//КонецЦикла;
	//Для НомКол = 3 По 11 Цикл
	//	Области["П0000020012" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение =
	//		  Области["П0000020013" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000020019" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение;
	//КонецЦикла;
	//// По разделу 3.
	//Для НомКол = 3 По 8 Цикл
	//	Области["П0000030039" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение =
	//		  Области["П0000030040" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030041" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение;
	//КонецЦикла;
	//Для НомКол = 3 По 8 Цикл
	//	Области["П0000030046" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение =
	//		  Области["П0000030047" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030048" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030049" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030050" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030051" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030054" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030055" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030057" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030058" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение;
	//КонецЦикла;
	//Для НомКол = 3 По 8 Цикл
	//	Области["П0000030059" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение =
	//		  Области["П0000030039" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение
	//		+ Области["П0000030046" + Формат(НомКол, "ЧЦ=2; ЧВН=; ЧГ=")].Значение;
	//КонецЦикла;
	//Для НомСтр = 39 По 59 Цикл
	//	Области["П000003" + Формат(НомСтр, "ЧЦ=4; ЧВН=; ЧГ=") + "09"].Значение =
	//		  Области["П000003" + Формат(НомСтр, "ЧЦ=4; ЧВН=; ЧГ=") + "04"].Значение
	//		+ Области["П000003" + Формат(НомСтр, "ЧЦ=4; ЧВН=; ЧГ=") + "05"].Значение
	//		+ ?(НомСтр <> 45, Области["П000003" + Формат(НомСтр, "ЧЦ=4; ЧВН=; ЧГ=") + "06"].Значение, 0);
	//КонецЦикла;
	// БИТ_ЖКХ 24.04.2017 10:00:26 Конец правки. 
	
КонецПроцедуры

#КонецОбласти
